; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_9_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 - counter
	)
  (:init
		(= (value c0) 91)
	(= (value c1) 32)
	(= (value c2) 92)
	(= (value c3) 42)
	(= (value c4) 84)
	(= (value c5) 11)
	(= (value c6) 7)
	(= (value c7) 97)
	(= (value c8) 38)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
		)
	)
)

; plan
1. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 3 of 8
2. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 3 of 8
3. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 3 of 8
4. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 3 of 8
5. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 3 of 8
6. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 3 of 8
7. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 3 of 8
8. (increase_rate c5)
   changed: (rate_value c5) from 5 to 6
   goals met: 3 of 8
9. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 3 of 8
10. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 3 of 8
11. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 3 of 8
12. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 3 of 8
13. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 3 of 8
14. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 3 of 8
15. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 3 of 8
16. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 3 of 8
17. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 3 of 8
18. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 3 of 8
19. (increase_rate c8)
   changed: (rate_value c8) from 4 to 5
   goals met: 3 of 8
20. (increase_rate c8)
   changed: (rate_value c8) from 5 to 6
   goals met: 3 of 8
21. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 3 of 8
22. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 3 of 8
23. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 3 of 8
24. (increase_rate c8)
   changed: (rate_value c8) from 6 to 7
   goals met: 3 of 8
25. (increase_rate c8)
   changed: (rate_value c8) from 7 to 8
   goals met: 3 of 8
26. (increase_rate c5)
   changed: (rate_value c5) from 6 to 7
   goals met: 3 of 8
27. (decrement c5)
   changed: (value c5) from 11 to 4
   goals met: 4 of 8
28. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 4 of 8
29. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 4 of 8
30. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 4 of 8
31. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 4 of 8
32. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 4 of 8
33. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 4 of 8
34. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 4 of 8
35. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 4 of 8
36. (increase_rate c0)
   changed: (rate_value c0) from 2 to 3
   goals met: 4 of 8
37. (increase_rate c0)
   changed: (rate_value c0) from 3 to 4
   goals met: 4 of 8
38. (increase_rate c1)
   changed: (rate_value c1) from 6 to 7
   goals met: 4 of 8
39. (increase_rate c1)
   changed: (rate_value c1) from 7 to 8
   goals met: 4 of 8
40. (increase_rate c8)
   changed: (rate_value c8) from 8 to 9
   goals met: 4 of 8
41. (increment c8)
   changed: (value c8) from 38 to 47
   goals met: 4 of 8
42. (increment c8)
   changed: (value c8) from 47 to 56
   goals met: 4 of 8
43. (increment c8)
   changed: (value c8) from 56 to 65
   goals met: 4 of 8
44. (increment c8)
   changed: (value c8) from 65 to 74
   goals met: 4 of 8
45. (increase_rate c8)
   changed: (rate_value c8) from 9 to 10
   goals met: 4 of 8
46. (increment c8)
   changed: (value c8) from 74 to 84
   goals met: 4 of 8
47. (increment c8)
   changed: (value c8) from 84 to 94
   goals met: 4 of 8
48. (decrement c7)
   changed: (value c7) from 97 to 93
   goals met: 5 of 8
49. (increase_rate c5)
   changed: (rate_value c5) from 7 to 8
   goals met: 5 of 8
50. (increment c5)
   changed: (value c5) from 4 to 12
   goals met: 4 of 8
51. (increment c5)
   changed: (value c5) from 12 to 20
   goals met: 4 of 8
52. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 4 of 8
53. (increment c6)
   changed: (value c6) from 7 to 10
   goals met: 4 of 8
54. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 4 of 8
55. (increment c3)
   changed: (value c3) from 42 to 48
   goals met: 4 of 8
56. (increment c3)
   changed: (value c3) from 48 to 54
   goals met: 4 of 8
57. (increase_rate c3)
   changed: (rate_value c3) from 6 to 7
   goals met: 4 of 8
58. (increase_rate c3)
   changed: (rate_value c3) from 7 to 8
   goals met: 4 of 8
59. (increment c3)
   changed: (value c3) from 54 to 62
   goals met: 4 of 8
60. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 4 of 8
61. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 4 of 8
62. (increase_rate c3)
   changed: (rate_value c3) from 8 to 9
   goals met: 4 of 8
63. (increment c3)
   changed: (value c3) from 62 to 71
   goals met: 4 of 8
64. (increase_rate c3)
   changed: (rate_value c3) from 9 to 10
   goals met: 4 of 8
65. (increment c3)
   changed: (value c3) from 71 to 81
   goals met: 4 of 8
66. (increment c3)
   changed: (value c3) from 81 to 91
   goals met: 3 of 8
67. (decrement c2)
   changed: (value c2) from 92 to 90
   goals met: 4 of 8
68. (increase_rate c1)
   changed: (rate_value c1) from 8 to 9
   goals met: 4 of 8
69. (increment c1)
   changed: (value c1) from 32 to 41
   goals met: 4 of 8
70. (increment c1)
   changed: (value c1) from 41 to 50
   goals met: 4 of 8
71. (increment c1)
   changed: (value c1) from 50 to 59
   goals met: 4 of 8
72. (increment c1)
   changed: (value c1) from 59 to 68
   goals met: 4 of 8
73. (increase_rate c1)
   changed: (rate_value c1) from 9 to 10
   goals met: 4 of 8
74. (increment c1)
   changed: (value c1) from 68 to 78
   goals met: 4 of 8
75. (increment c1)
   changed: (value c1) from 78 to 88
   goals met: 4 of 8
76. (decrement c0)
   changed: (value c0) from 91 to 87
   goals met: 5 of 8
77. (increase_rate c5)
   changed: (rate_value c5) from 8 to 9
   goals met: 5 of 8
78. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 5 of 8
79. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 5 of 8
80. (increment c5)
   changed: (value c5) from 20 to 29
   goals met: 5 of 8
81. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 5 of 8
82. (increment c5)
   changed: (value c5) from 29 to 38
   goals met: 5 of 8
83. (increment c5)
   changed: (value c5) from 38 to 47
   goals met: 5 of 8
84. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 5 of 8
85. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 5 of 8
86. (increase_rate c6)
   changed: (rate_value c6) from 5 to 6
   goals met: 5 of 8
87. (increment c6)
   changed: (value c6) from 10 to 16
   goals met: 5 of 8
88. (increment c6)
   changed: (value c6) from 16 to 22
   goals met: 5 of 8
89. (increment c6)
   changed: (value c6) from 22 to 28
   goals met: 5 of 8
90. (increment c6)
   changed: (value c6) from 28 to 34
   goals met: 5 of 8
91. (increment c5)
   changed: (value c5) from 47 to 56
   goals met: 5 of 8
92. (increment c5)
   changed: (value c5) from 56 to 65
   goals met: 5 of 8
93. (increase_rate c5)
   changed: (rate_value c5) from 9 to 10
   goals met: 5 of 8
94. (increase_rate c6)
   changed: (rate_value c6) from 6 to 7
   goals met: 5 of 8
95. (increment c6)
   changed: (value c6) from 34 to 41
   goals met: 5 of 8
96. (increment c5)
   changed: (value c5) from 65 to 75
   goals met: 5 of 8
97. (increase_rate c6)
   changed: (rate_value c6) from 7 to 8
   goals met: 5 of 8
98. (increase_rate c6)
   changed: (rate_value c6) from 8 to 9
   goals met: 5 of 8
99. (increase_rate c6)
   changed: (rate_value c6) from 9 to 10
   goals met: 5 of 8
100. (increment c6)
   changed: (value c6) from 41 to 51
   goals met: 5 of 8
101. (increment c6)
   changed: (value c6) from 51 to 61
   goals met: 5 of 8
102. (increment c6)
   changed: (value c6) from 61 to 71
   goals met: 5 of 8
103. (increment c6)
   changed: (value c6) from 71 to 81
   goals met: 6 of 8
104. (increment c5)
   changed: (value c5) from 75 to 85
   goals met: 6 of 8
105. (increment c6)
   changed: (value c6) from 81 to 91
   goals met: 7 of 8
106. (decrement c3)
   changed: (value c3) from 91 to 81
   goals met: 7 of 8
107. (decrement c2)
   changed: (value c2) from 90 to 88
   goals met: 6 of 8
108. (decrement c2)
   changed: (value c2) from 88 to 86
   goals met: 6 of 8
109. (decrement c2)
   changed: (value c2) from 86 to 84
   goals met: 6 of 8
110. (decrement c2)
   changed: (value c2) from 84 to 82
   goals met: 6 of 8
111. (decrement c2)
   changed: (value c2) from 82 to 80
   goals met: 7 of 8
112. (decrement c1)
   changed: (value c1) from 88 to 78
   goals met: 7 of 8
113. (decrement c0)
   changed: (value c0) from 87 to 83
   goals met: 7 of 8
114. (decrement c0)
   changed: (value c0) from 83 to 79
   goals met: 7 of 8
115. (decrement c0)
   changed: (value c0) from 79 to 75
   goals met: 8 of 8
